In [1]:
# Pandas in Python--->Pandas---->panel data--->2D data
# Used for advanced mathametical calculation.

In [3]:
import pandas as pd
import numpy as np

# Dataframe
df=pd.read_csv("dataset.csv")
print(df)

  School     Name Gender  Math  Science
0    BVS    Suman      M    80       75
1    BVS  Bitisha      F    90       95
2    KMC    Eurek      M    70       65
3    KMC     Sony      F    85       90
4    KMC   Sameer      M    92       66
5    KMC  Yunisha      F    93       82
6    BVS     Ravi      M    74       64
7    BVS  Dilasha      F    72       96

In [5]:
# First data Inspection (by default)
# 4 steps to understand the gest of data.
# 1st step
df.head() # It will give the first 5 information of data.

  School     Name Gender  Math  Science
0    BVS    Suman      M    80       75
1    BVS  Bitisha      F    90       95
2    KMC    Eurek      M    70       65
3    KMC     Sony      F    85       90
4    KMC   Sameer      M    92       66

In [7]:
# Secong step
df.tail()

  School     Name Gender  Math  Science
3    KMC     Sony      F    85       90
4    KMC   Sameer      M    92       66
5    KMC  Yunisha      F    93       82
6    BVS     Ravi      M    74       64
7    BVS  Dilasha      F    72       96

In [11]:
# third step find the statistics of dataset
df.describe() # Numerical Column

            Math    Science
count   8.000000   8.000000
mean   82.000000  79.125000
std     9.304377  13.527089
min    70.000000  64.000000
25%    73.500000  65.750000
50%    82.500000  78.500000
75%    90.500000  91.250000
max    93.000000  96.000000

In [13]:
# Fourth steps 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   School   8 non-null      object
 1   Name     8 non-null      object
 2   Gender   8 non-null      object
 3   Math     8 non-null      int64
 4   Science  8 non-null      int64
dtypes: int64(2), object(3)
memory usage: 452.0+ bytes

In [15]:
# Fifth Step
# Assignment
# Some dataset do not have missing value and some have missing value.

In [25]:
import numpy as np
import pandas as pd
mask=np.random.rand(*df.shape) < 0.1
print(mask)
df[mask]=np.nan

[[ True False  True False False]
 [False False False False False]
 [False False False False False]
 [False  True False False False]
 [False False False False False]
 [False False  True False False]
 [ True False False False False]
 [False False False False False]]

In [27]:
print(df)

  School     Name Gender  Math  Science
0    BVS    Suman      M    80       75
1    BVS  Bitisha      F    90       95
2    KMC    Eurek      M    70       65
3    KMC     Sony      F    85       90
4    KMC   Sameer      M    92       66
5    KMC  Yunisha      F    93       82
6    BVS     Ravi      M    74       64
7    BVS  Dilasha      F    72       96

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   School   8 non-null      object
 1   Name     8 non-null      object
 2   Gender   8 non-null      object
 3   Math     8 non-null      int64
 4   Science  8 non-null      int64
dtypes: int64(2), object(3)
memory usage: 452.0+ bytes

In [31]:
df.isnull().any()

School     False
Name       False
Gender     False
Math       False
Science    False
dtype: bool

In [33]:
df.isnull().sum() # Column wise

School     0
Name       0
Gender     0
Math       0
Science    0
dtype: int64

In [35]:
df.isnull().sum().sum() # df entire dataframe sum

0

In [37]:
# Handle missing values
# Some of the popular method are ffill, bfill, mean fill, mode fill, median fill
# Mean and median for numeric data and mode for categorical data

In [39]:
df["Math"]=df["Math"].fillna(df["Math"].mean())
print(df)

  School     Name Gender  Math  Science
0    BVS    Suman      M    80       75
1    BVS  Bitisha      F    90       95
2    KMC    Eurek      M    70       65
3    KMC     Sony      F    85       90
4    KMC   Sameer      M    92       66
5    KMC  Yunisha      F    93       82
6    BVS     Ravi      M    74       64
7    BVS  Dilasha      F    72       96

In [43]:
df["Science"]=df["Science"].fillna(df["Science"].median())
print(df)

  School     Name Gender  Math  Science
0    BVS    Suman      M    80       75
1    BVS  Bitisha      F    90       95
2    KMC    Eurek      M    70       65
3    KMC     Sony      F    85       90
4    KMC   Sameer      M    92       66
5    KMC  Yunisha      F    93       82
6    BVS     Ravi      M    74       64
7    BVS  Dilasha      F    72       96

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   School   8 non-null      object
 1   Name     8 non-null      object
 2   Gender   8 non-null      object
 3   Math     8 non-null      int64
 4   Science  8 non-null      int64
dtypes: int64(2), object(3)
memory usage: 452.0+ bytes

In [47]:

print(df["School"].mode())

0    BVS
1    KMC
Name: School, dtype: object

In [51]:
# After handing missing data, I am assured that my dataset is not complete. So, to check it I can perform following function.
df.isnull().sum().sum()
# so, i am assured that the dataset have missing value

0

In [55]:
# Filtering dataset
print(df)
filtered=df[df["Science"]>70]
print("\n Filtered row is \n: ",filtered)

  School     Name Gender  Math  Science
0    BVS    Suman      M    80       75
1    BVS  Bitisha      F    90       95
2    KMC    Eurek      M    70       65
3    KMC     Sony      F    85       90
4    KMC   Sameer      M    92       66
5    KMC  Yunisha      F    93       82
6    BVS     Ravi      M    74       64
7    BVS  Dilasha      F    72       96

 Filtered row is
:    School     Name Gender  Math  Science
0    BVS    Suman      M    80       75
1    BVS  Bitisha      F    90       95
3    KMC     Sony      F    85       90
5    KMC  Yunisha      F    93       82
7    BVS  Dilasha      F    72       96

In [61]:
filtered=df[(df["Science"]>70) & (df["Math"]>80)]
print(filtered)

  School     Name Gender  Math  Science
1    BVS  Bitisha      F    90       95
3    KMC     Sony      F    85       90
5    KMC  Yunisha      F    93       82

In [65]:
filtered=df[df["Gender"]=="M"]
print(filtered)

  School    Name Gender  Math  Science
0    BVS   Suman      M    80       75
2    KMC   Eurek      M    70       65
4    KMC  Sameer      M    92       66
6    BVS    Ravi      M    74       64

In [73]:
# Colum Science average > row is input:
science_avg = df['Science'].mean()
print("\nAverage of Science column:", science_avg)
filtered = df[df['Science'] > df["Science"].mean()]
filtered = df[df['Science'] > science_avg]
print("\nRows where Science > average:\n", filtered)
print("\nRows where Science > average:\n", filtered)

Average of Science column: 79.125

Rows where Science > average:
   School     Name Gender  Math  Science
1    BVS  Bitisha      F    90       95
3    KMC     Sony      F    85       90
5    KMC  Yunisha      F    93       82
7    BVS  Dilasha      F    72       96

Rows where Science > average:
   School     Name Gender  Math  Science
1    BVS  Bitisha      F    90       95
3    KMC     Sony      F    85       90
5    KMC  Yunisha      F    93       82
7    BVS  Dilasha      F    72       96

In [1]:
# Week-5 Assignment
# First search a cvs file.
# Perform First Data Inspection. head, tail, info
# Check if there are any missing values or not. If there are no missing values, introduce some missing 
# values-->randomly*---->imp
# Now, use of isnull() methods, (isnull.sum, isnull.any, isnull.sum.sum) to identity total count of missing values.
# Data imputation or Handling missing value using fillna

In [ ]:
# Advanced groupby methods

# Grouping and aggregating